import React from "react";
import Book from "./book";

function App() {
  const handleButtonClick = (title, characters) => {
    console.log(`Book Title: ${title}`);
    console.log("Characters:", characters.join(", "));
  };

  return (
    <div>
      <Book
        image="./Data_tutashkhia.jpg"
        title="დათა თუთაშხია"
        description="რომანი დაყოფილია 4 ნაწილად და მოთხრობილია მისი გმირის მორალური ევოლუციის შესახებ იმ პიროვნებების გადმოსახედიდან, რომლებთანაც წარსულში კავშირი ჰქონდა. დათა თუთაშხია არის ადამიანი, რომელიც დაბადებიდან ვერ იტანს უსამართლობას და უკანონობას. თავიდანვე, რომანში ვიგებთ, რომ იგი იყო ბრალდებული შემთხვევითი მკვლელობის თანამონაწილეობისათვის. მას შემდეგ დაიწყო ცხოვრება, როგორც ტყეში გასულმა და სასოწარკვეთილი ჟანდარმერიის მუდმივად დევნილმა. მთელი რომანის განმავლობაში, თუთაშხია იცვლის ადგილსამყოფელს, ხედავს ბოროტებას და ცდილობს როგორმე დასძლიოს იგი.

რომანის პირველი ნაწილის ძირითადი თავი მოსე ზამთარაძის მონათხრობს ეთმობა. თუთაშხია და ზამთარაძე (ორი აბრაგი) თავს საირმის ტყეს შეაფარებენ და საოცარ ამბავში გაეხვევიან. ბელადად და მამა-მარჩენალად წოდებული არქიფო სეთურისგან ხალხის ხსნის ცდა საწინააღმდეგოდ შემოუტრიალდებათ და გალახულებს გამოყრიან სოფლიდან. ამ ნაწილის დამამახსოვრებელი თავია იგავი ვირთხების შესახებ, რომლებიც შიმშილობის ნიადაგზე ერთმანეთის ჭამას იწყებენ და უძლიერესს ბოლოს გამოავლენენ.

რომანის მეორე ნაწილში დათა თუთაშხია, მისი წინა გამოცდილებიდან გამომდინარე, გადაწყვეტს, რომ აღარ ჩაერიოს სოციალურ საკითხებში, თუ სრულიად არ იქნება დარწმუნებული, რომ მისი ქმედებები კარგის მომტანი იქნება. მისი ახალი პოზიციის შედეგად ხალხი ივიწყებს ყველა მის კარგ საქმეს წარსულში, რაც გარდამტეხი აღმოჩნდება მისი გულგრილობისა.

რომანის მესამე ნაწილში, თუთაშხია, რომელმაც ამ ეტაპზე დაკარგა თავისი გზა, ცდილობს გაერიოს საზოგადოებაში, რათა თვითონ განსაზღვროს ცხოვრების მნიშვნელობა და ფილოსოფია. ის უერთდება ადვოკატის, საიდუმლოებით მოცული ქალის პატარა საზოგადოებრივ წრეს და ესწრება სხვადასხვა სუფრებს, სადაც იმართება დებატები ფილოსოფიურ თემებზე. ერთ-ერთ ასეთ საღამოზე მათ გრაფი სეგედიც კი ეწვევათ, თუმცა თუთაშხიას დაჭერას ვერ შეძლებენ.

რომანის მეოთხე ნაწილში, დათა თუთაშხია მიხვდება, რომ ბოროტების დაძლევა მხოლოდ და მხოლოდ ძალით შეიძლება. ამავდროულად მისი ბიძაშვილი ერთ-ერთი რუსული იმპერიული ჟანდარმერიის საუკეთესო თანამშრომელია. მუშნი ზარანდია სრულიად „ერთგულია“ მისი სამუშაოს მიმართ და „ობიექტურად“ და გულმოდგინედ მეთვალყურეობს რეგიონში „სახიფათო“ დამნაშავეების ძიებას, როგორიცაა მისი ბიძაშვილი. ორივე ბიძაშვილის საუბედუროდ მათ შეხვედრის შესაძლებლობაც კი არ ეძლევათ. თუთაშხია გადაწყვეტს მუშნის სასიკეთოდ ციხეში ნებით ჩაჯდეს.

წიგნის უკანასკნელ ნაწილში, თუთაშხია თავისი წარსული გამოცდილებით საბოლოოდ მიხვდება, რომ საუკეთესო გზა აარიდო მსოფლიოს ბოროტება, არის იყო კარგი ადამიანი და აკეთო სიკეთე. მიუხედევად ყველაფრისა,როგორც ყველა გმირის, ისევე თუთაშხიას ბედი ერთია - სიკვდილი."
        characters={["დათა თუთაშხია ", "მუშნი ზარანდია", "რაჟა სარჩიმელია"]}
        onButtonClick={handleButtonClick}
      />
    </div>
  );
}

export default App;
